{
    "model_type": "otter",
    "cross_attn_every_n_layers": 2,
    "tie_word_embeddings": false,
    "use_media_placement_augmentation": true,
    "only_attend_previous": true,
    "text_config": {
        "_name_or_path": "togethercomputer/RedPajama-INCITE-Base-3B-v1",
        "architectures": [
          "GPTNeoXForCausalLM"
        ],
        "bos_token_id": 0,
        "eos_token_id": 0,
        "hidden_act": "gelu",
        "hidden_size": 2560,
        "initializer_range": 0.02,
        "intermediate_size": 10240,
        "layer_norm_eps": 1e-05,
        "max_position_embeddings": 2048,
        "model_type": "gpt_neox",
        "num_attention_heads": 32,
        "num_hidden_layers": 32,
        "rotary_emb_base": 10000,
        "rotary_pct": 1.0,
        "tie_word_embeddings": false,
        "use_cache": true,
        "use_parallel_residual": false,
        "vocab_size": 50432
      },
    "vision_config": {
        "_name_or_path": "openai/clip-vit-large-patch14",
        "model_type": "clip_vision_model",
        "hidden_size": 1024,
        "intermediate_size": 4096,
        "num_attention_heads": 16,
        "num_hidden_layers": 24,
        "image_size": 224,
        "patch_size": 14
    }
}